MCP/cases-7.x/anemometerF460/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.003;

boundaryField
{

    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;

        //- Inlet hydraulic diameter * 0.07 
        //  d_hyd = 4 * Area / Perimeter
        mixingLength    4*(0.9*0.9)/(4*0.9)*0.07;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    fixedWalls
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    movingWalls
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}

// ************************************************************************* //
